@echo off
pushd ..
popd
set D42_message="%~n0"
set D42_pathmb="%~dp0"
set D42_pathmb=%D42_pathmb:~0,-4%
pushd %D42_pathmb%
::主代码
rem ----------------------------------------------------------主代码
echo,输入年份
echo,只允许输入2013/2014
(set /p a=-^>****年)<nul
1>nul 2>nul choice /c 2
set /a num=%errorlevel%+1
(set /p a=%num%)<nul
1>nul 2>nul choice /c 0
set /a num=%errorlevel%-1
(set /p a=%num%)<nul
1>nul 2>nul choice /c 1
set /a num=%errorlevel%
(set /p a=%num%)<nul
1>nul 2>nul choice /c 34
set /a num=%errorlevel%+2
(set /p a=%num%)<nul
echo,
pause
exit

::一层c
rem ----------------------------------------------------------一层c
::函数1

::函数1 end
::函数2

::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
