@echo off
set D13_message="%~n0"
set D13_pathmb="%~dp0"
set D13_pathmb=%D13_pathmb:~0,-4%
pushd %D13_pathmb%
::主代码
rem ----------------------------------------------------------主代码
set message=去除空行
:D13_begin
cls
call a\a2_获取路径.bat 1 1 0 1
cd.>"%a2_pathmb%D13_临时文件.txt"
for /f "usebackq tokens=* delims=" %%i in ("%a2_pathly%") do (
>>"%a2_pathmb%D13_临时文件.txt" echo,%%i
>>"%a2_pathmb%D13_临时文件.txt" echo,
)
del /q /s "%a2_pathly%"
ren "%a2_pathmb%D13_临时文件.txt" "%a2_name%%a2_type%"
goto D13_begin
::一层c
rem ----------------------------------------------------------一层c
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:空行处理
【文件名称   】:两行间添加一空行
::属性说明 end
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
rem ----------------------------------------------------------主代码 end
::主代码 end

