@echo off
set D15_message="%~n0"
set D15_pathmb="%~dp0"
set D15_pathmb=%D15_pathmb:~0,-4%
pushd %D15_pathmb%
::主代码
rem ----------------------------------------------------------主代码
rem 一、系统参数
set D15_systemset.number=0123456789
set D15_systemset.xiaoxie=abcdefghijklmnopqrstuvwxyz
set D15_systemset.daxie=ABCDEFGHIJKLMNOPQRSTUVWXYZ
rem 二、用户设置偏移量
set /p D15_userset.piyiliang=输入偏移量 

rem 三、获取数据
rem 暂时模拟数据
set D15_mima.data1.key=支付宝账号
set D15_mima.data1.value=fadsfe3
set D15_mima.data2.key=qq账号
set D15_mima.data2.value=fads3213
set D15_mima.count=2

rem 四、显示原来的密码
for %%i in (1,1,%D15_mima.count%) do (
	echo,y
)
pause

::一层c
rem ----------------------------------------------------------一层c
::函数1

::函数1 end
::函数2

::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
