@echo off
set D1_message="%~n0"
set D1_pathmb="%~dp0"
set D1_pathmb=%D1_pathmb:~0,-4%
pushd %D1_pathmb%
::主代码
rem ----------------------------------------------------------主代码
:D1_begin
set message=查看批处理call
call a\a2_获取路径.bat 1 1 0 1
call a\a13_查看call.bat 1 1 a2_pathly
cls
echo,
type a13_call信息2.txt
echo,
pause>nul
goto :D1_begin
::一层c
rem ----------------------------------------------------------一层c
::函数1

::函数1 end
::函数2

::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
