@echo off
pushd ..
popd
set D35_message="%~n0"
set D35_pathmb="%~dp0"
set D35_pathmb=%D35_pathmb:~0,-4%
pushd %D35_pathmb%
::主代码
rem ----------------------------------------------------------主代码
@echo off 
color 0a 
:start 
set num=0 
set "echos= " 
:num 
set /a a1=%random%%%3 
if "%a1%" == "1" set "a1= " 
if "%a1%" == "2" set "a1= " 
if "%a1%" == "0" set /a a1=%random%%%2 
set echos=%echos%%a1% 
set /a num=%num%+1 
if "%num%" == "75" echo %echos%&&goto :start 
goto :num
::一层c
rem ----------------------------------------------------------一层c
::函数1

::函数1 end
::函数2

::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
