@echo off
pushd ..
popd
set D39_message="%~n0"
set D39_pathmb="%~dp0"
set D39_pathmb=%D39_pathmb:~0,-4%
pushd %D39_pathmb%
::主代码
rem ----------------------------------------------------------主代码
set D39_num=0
setlocal EnableDelayedExpansion
for /f %%i in ('dir /b/s "D:\workspace\partyaffairsplt1.0_zhbg"') do (
	set /a D39_num=!D39_num!+1
)
echo,共有【!D39_num!】个文件
endlocal
set D39_num=0
for /f %%i in ('dir /b/s "D:\workspace\partyaffairsplt1.0_zhbg"') do (
	call :D39_addnum
)
echo,共有【%D39_num%】个文件
pause
goto :exit
::一层c
rem ----------------------------------------------------------一层c
::函数1

::函数1 end
::函数2

::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
:D39_addnum
set /a D39_num=%D39_num%+1
goto :eof
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
