@echo off
set pathly="%~0"
for /l %%i in (1,1,100) do (
if not exist D%%i_*.bat (
call :main %%i
goto finish
)
)
:finish
echo,完成!
ping /n 2 127.1>nul
exit
:main
cd.>D%1_未命名.bat
(echo,@echo off
echo,pushd ..
echo,popd
echo,set D%1_message="%%~n0"
echo,set D%1_pathmb="%%~dp0"
echo,set D%1_pathmb=%%D%1_pathmb:~0,-4%%
echo,pushd %%D%1_pathmb%%
echo,::主代码
echo,rem ----------------------------------------------------------主代码
echo,
)>>D%1_未命名.bat
set act=
for /f "usebackq tokens=*" %%i in (%pathly%) do (
if "%%i"=="::模板 end" goto :eof
if defined act (
>>D%1_未命名.bat echo,%%i
)
if "%%i"=="::模板" set act=on
)
goto :eof
::模板
::一层c
rem ----------------------------------------------------------一层c
  ::函数1
 
  ::函数1 end
  ::函数2
 
  ::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
::模板 end