@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
call :a11_main1 "%%%3:"=%%" "%%%4:"=%%"
for %%i in (%a11_pathly%) do (
set a11_type=%%~xi
set a11_pathmb=%%~dpi
set a11_name=%%~ni
)
if "%a11_type%"==".rar" goto :eof
cls
echo,
echo,正在压缩%a11_pathly%...
if %a11_str1%=="" (
start /wait "" winrar.exe a -ep1 -rr"30p" "%a11_pathmb%%a11_name%.rar" %a11_pathly%
)else (
start /wait "" winrar.exe a -ep1 -hp%a11_str1% -rr"30p" "%a11_pathmb%%a11_name%.rar" %a11_pathly%
)
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a11_main1
echo,
set a11_pathly=%1
set a11_str1=%2
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:压缩
【文件名称   】:压缩文件(可加密)
【参数说明   】:
%1、%2参数无意义
%3参数为路径变量名 %4参数为密码变量名(可以缺省)
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
