@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码


set a15_username=%3
set a15_password=%4
set a15_owner=%5


rem 创建临时文件夹
if not exist a15_临时文件夹 (
	md a15_临时文件夹
)


rem 生成sql文件，获取包含删除语句的日志
(
echo,conn %a15_username%/%a15_password%;
echo,spool "a15_临时文件夹\a15_包含删除语句的日志.txt";
echo,select 'drop table '^|^|table_name^|^|';' from all_tables where owner='%a15_owner%';
echo,spool off;
echo,exit;
)>a15_临时文件夹\a15_获取包含删除语句的日志.sql

rem 执行sql文件
sqlplus / as sysdba@orcl @a15_临时文件夹\a15_获取包含删除语句的日志.sql


rem 从日志中解析出删除语句，获取删除表的sql文件
>a15_临时文件夹\a15_删除语句.sql echo,conn %a15_username%/%a15_password%;
for /f "usebackq tokens=1,2,*" %%i in ("a15_临时文件夹\a15_包含删除语句的日志.txt") do (
	if %%i==drop (
		>>a15_临时文件夹\a15_删除语句.sql echo,%%i %%j %%k
	)
)
>>a15_临时文件夹\a15_删除语句.sql echo,exit;

rem 执行sql文件
sqlplus / as sysdba@orcl @a15_临时文件夹\a15_删除语句.sql

goto :eof


::一层c
rem ----------------------------------------------------------一层c



rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:
【文件名称   】:
【参数说明   】:
%1、%2参数无意义

给定用户名/密码 owner   就可以删除该用户下的所有表


::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
