@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
::主代码
rem ----------------------------------------------------------主代码
rem 一、功能说明 将数字转换成中文  数字的范围为1-99
rem 二、调用方法
rem 第一个无意义，第二个参数选择中文样式，0-一二的写法，1-壹贰的写法，第三个参数表示要变量名，变量值为1-99的一个数字
rem 三、结果调用
rem 结果保存a1_result环境变量中
rem 

if not "%2"=="0" (
	set a1_str1=壹贰叁泗伍陆柒捌氿拾
) else (
	set a1_str1=一二三四五六七八九十
)
call :a1_main %%%3%%
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a1_main
set a1_str2=%1
if %a1_str2% lss 11 (
call :a1_main.3
goto :eof
)
set a1_str2.1=%a1_str2:~0,1%
set a1_str2.2=%a1_str2:~1,1%
if %a1_str2.2% equ 0 (
call :a1_main.1
)else (
call :a1_main.2
)
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
:a1_main.1
set /a a1_str2.1=%a1_str2.1%-1
call :a1_main.4 %%a1_str1:~%a1_str2.1%,1%%%a1_str1:~-1%
goto :eof
:a1_main.2
if %a1_str2% lss 20 (
call :a1_main.2.1
)else (
call :a1_main.2.2
)
goto :eof
:a1_main.3
set /a a1_str2=%a1_str2%-1
call :a1_main.4 %%a1_str1:~%a1_str2%,1%%
goto :eof
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
:a1_main.2.1
set /a a1_str2.2=%a1_str2.2%-1
call :a1_main.4 %a1_str1:~-1%%%a1_str1:~%a1_str2.2%,1%%
goto :eof
:a1_main.2.2
set /a a1_str2.1=%a1_str2.1%-1
set /a a1_str2.2=%a1_str2.2%-1
call :a1_main.4 %%a1_str1:~%a1_str2.1%,1%%%a1_str1:~-1%%%a1_str1:~%a1_str2.2%,1%%
goto :eof
:a1_main.4
set a1_result=%1
goto :eof
rem ----------------------------------------------------------三层c end
::三层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
将数字转换成中文，1-99。
%3参数为保存数字的变量名。
返回的变量为a1_result
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:变量处理
【文件名称   】:将数字转换成中文(1-100)
【参数说明   】:%3参数-数字变量的名称
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit