@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
rem %1 开始时间 2012/03/04
rem %2 结束时间	2013/03/05
rem %3 变量名 如a.list[]   a.list[1] a.list[2] ...
rem 一、开始日期与结束日期相等
if "%1"=="%2" (
set %3.list[]=1
set %3.list[1]=%1
goto :eof
)
rem 二、
set a24_startdate=%1
set a24_enddate=%2
call a\a19_getnextdate.bat a24_enddate a24_enddate
rem 循环变量
set a24_loop.var=0
rem 循环
:a24_loop
set /a a24_loop.var=%a24_loop.var%+1
if "%a24_loop.var%"=="1" (
	set %3.list[1]=%a24_startdate%
	call a\a19_getnextdate.bat %3.list[1] a24_nextdate
) else (
	set %3.list[%a24_loop.var%]=%a24_nextdate%
	call a\a19_getnextdate.bat %3.list[%a24_loop.var%] a24_nextdate
)
if "%a24_nextdate%"=="%a24_enddate%" (
	goto :a24_loopend
) else (
	goto :a24_loop
)
:a24_loopend
set %3.list[]=%a24_loop.var%
goto :eof
::一层c
rem ----------------------------------------------------------一层c
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:
【文件名称   】:
【参数说明   】:
%1、%2参数无意义
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
