@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
rem 1、功能：读取文本文件中两个指定行之间的内容，将结果放入数组中
rem 2、参数设计
rem 源文件路径(要求带引号)　开始行内容变量(考虑到如果传递内容，则要求内容中不能有空格、特殊字符等，会有较大的限制,要求没引号)　结束行内容变量　数组变量名
rem    %1                             %2                                                                                              %3             %4
set a29_path=%1
set a29_arrname=%4
call a\a20_varcopy.bat %2 a29_startline
call a\a20_varcopy.bat %3 a29_endline
set a29_arrnum=0

set a29_in=
for /f "usebackq tokens=*" %%i in (%a29_path%) do (
	if "%%~i"=="%a29_endline.truevalue%" goto :a29_end
	if defined a29_in (
		set a29_linevalue=%%i
		call :a29_arr
	)
	if "%%~i"=="%a29_startline.truevalue%" set a29_in=true
)
:a29_end
set %4.list[]=%a29_arrnum%
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a29_arr
set /a a29_arrnum=%a29_arrnum%+1
call a\a20_varcopy.bat a29_linevalue %a29_arrname%.list[%a29_arrnum%]
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:
【文件名称   】:
【参数说明   】:
%1、%2参数无意义
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
