@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
rem 说明
rem 将一个整数变成小数(整数小数点左移)
rem 相当于除法，只不过除数为10、100、1000等... 
rem 
rem %1是要处理的整数  %2是小数点向左移动的为数  %3保存处理结果的变量
rem 

set /a a31_num=1000000000+%1
set a31_pianyiliang=%2

call :a31_setFirstValue %%a31_num:~1,-%a31_pianyiliang%%%.%%a31_num:~-%a31_pianyiliang%%%

:start
for /f "tokens=*" %%i in ('echo,%a31_num%^|findstr "^0[0-9]"') do (
	set a31_num=%a31_num:~1%
	goto :start
)
set %3=%a31_num%

rem 清空环境变量
for /f "tokens=1" %%i in ('set a31_') do (
	set %%i=
)
goto :eof

::一层c
rem ----------------------------------------------------------一层c
:a31_setFirstValue
set a31_num=%1
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:
【文件名称   】:
【参数说明   】:
%1、%2参数无意义
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
