@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
set a37_source.name=%1
call a\a38_pathCopy.bat %1 a37_source
set a37_result.name=%2
call :a37_main
call a\a33_clearvar.bat a37_ 1
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a37_main
if exist %a37_source.showPathWithYh% (
	(2>nul pushd %a37_source.showPathWithYh%)||(goto a37_文件)
	set %a37_result.name%=wjj
	popd
) else (
	set %a37_result.name%=notExist
)
goto :eof
:a37_文件
set %a37_result.name%=wj
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
结果保存在a37_result中，结果为wj或wjj
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:路径处理
【文件名称   】:判断路径是文件还是文件夹
【参数说明   】:
%1、%2参数无意义
%3为路径变量名
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
