@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
call :a6_main "%%%3:"=%%"
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a6_main
set a6_str1=%1
set a6_str1=%a6_str1:^=^^^^^^^^%
set a6_str1=%a6_str1:&=^^^^^^^&%
set a6_str1=%a6_str1:|=^^^^^^^|%
set a6_str1=%a6_str1:<=^^^^^^^<%
set a6_str1=%a6_str1:>=^^^^^^^>%
set a6_str1=%a6_str1:"=%
if "%a6_str1:~-1%"=="\" (
set a6_result=qdq
)else (
set a6_result=pt
)
set a6_str1=
goto :eof
exit
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
set /p pathly=
当拖驱动器如G盘到批处理时，变量值为G:\；当拖文件夹如'G:\新建文件夹'到批处理时,变量值为G:\新建文件夹；前面的末尾有'\'，而后面的没有。
result=qdq表示pathly末尾为'\'，否则末尾不是'\'
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:路径处理
【文件名称   】:判断路径是否为驱动器
【参数说明   】:
%1、%2参数无意义
%3参数为路径变量名
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
