@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
set a7_str1=%3
if not defined %3 (
cls&echo,&echo,错误,变量【%3】没有定义!&pause
goto exit
)
setlocal EnableDelayedExpansion
set a7_str1=!%a7_str1%!
set a7_str1=!a7_str1:^^=^^^^!
set a7_str1=!a7_str1:^&=^^^&!
set a7_str1=!a7_str1:^|=^^^|!
set a7_str1=!a7_str1:^<=^^^<!
set a7_str1=!a7_str1:^>=^^^>!
set a7_act=
if "%4"=="100" set a7_str1=!a7_str1:"=^"!&set a7_act=on
if "%4"=="000" set a7_str1=!a7_str1:"=!&set a7_act=on
if "%4"=="011" (
set a7_str2=^^"
set a7_str1=!a7_str2!!a7_str1:"=!!a7_str2!
set a7_act=on
)
if "%4"=="010" (
set a7_str2=^^"
set a7_str1=!a7_str2!!a7_str1:"=!
set a7_act=on
)
if "%4"=="001" (
set a7_str2=^^"
set a7_str1=!a7_str1:"=!!a7_str2!
set a7_act=on
)
if not defined a7_act set a7_str1=!a7_str1:"=^"!
>a7_临时文件.txt echo,!a7_str1!
endlocal
for /f "tokens=*" %%i in (a7_临时文件.txt) do (
set %a7_str1%=%%i
)
goto:eof
::一层c
rem ----------------------------------------------------------一层c
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
处理后能直接引用来表示值(%4参数去不同值时，引号的处理不同，详细见下)，不要在前面加"或^
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:变量处理
【文件名称   】:变量处理_变量中的特殊字符非引号转义
【参数说明   】:%3参数表示变量名
%4参数: 100表示保留原来的引号并且不添加新的引号
        000表示不保留原来的引号并且不添加新的引号
        011表示不保留原来的引号并且两端添加新的引号
        010
        001
        其它情况 
%1、%2参数无意义
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
