@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
set a8_str1=%3
if not defined %3 (
cls&echo,&echo,错误,变量【%3】没有定义!&pause
goto exit
)
call :a8_main "%%%3:"=引_号%%"
call :a8_main %%%3:!=感_叹_号%%
setlocal EnableDelayedExpansion
set !a8_str1!=!%a8_str1%:"=!
set !a8_str1!=!%a8_str1%:^^=转_义!
set !a8_str1!=!%a8_str1%:^&=并_且!
set !a8_str1!=!%a8_str1%:^|=或_者!
set !a8_str1!=!%a8_str1%:^<=小_于!
set !a8_str1!=!%a8_str1%:^>=大_于!
set !a8_str1!=!%a8_str1%:%%=百_分_号!
set !a8_str1!=!%a8_str1%: =空_格!
rem ■set !a8_str1!=!%a8_str1%:^(=左_括!
rem ■set !a8_str1!=!%a8_str1%:^)=右_括!
>a8_临时文件.txt echo,!%a8_str1%!
endlocal
for /f "tokens=*" %%i in (a8_临时文件.txt) do (
set %a8_str1%=%%i
)
set a8_str1=
goto:eof
exit
::一层c
rem ----------------------------------------------------------一层c
:a8_main
set %a8_str1%=%1
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
处理的特殊字符:" ! ^ & | < > %
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:变量处理
【文件名称   】:变量处理_变量中的特殊字符标记
【参数说明   】:
%1、%2参数无意义
%3为要处理的变量名
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
