@echo off
set rem=echo,
set pause=pause

set pathly="%~0"
for /l %%i in (1,1,100) do (
if not exist a%%i_*.bat (
call :main %%i
goto finish
)
)
:finish
echo,完成!
ping /n 2 127.1>nul
%pause%
exit
:main
cd.>a%1_未命名.bat
set act=
for /f "usebackq tokens=* delims=" %%i in (%pathly%) do (
if "%%i"=="::模板 end" goto :eof
if defined act (
	%rem% %%i
	>>a%1_未命名.bat echo,%%i
)
if "%%i"=="::模板" set act=on
)
goto :eof
::模板
@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem 默认不开启调试模式
if "%rem%"=="" (
	set rem=rem 
)
  rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
::一层c
rem ----------------------------------------------------------一层c
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:
【文件名称   】:
【参数说明   】:
%1、%2参数无意义
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
::模板 end
