@echo off
rem ----------------------------------------------------------主代码
set D30_Table.path="%~0"
set D30_Table.name=D30_userData
set D30_Table.var=user
set D30_Table.load=
set D30_Table.num=0
for /f "usebackq tokens=*" %%i in (%D30_Table.path%) do (
	if "%%~i"=="::%D30_Table.name%_end" goto :D30_Table.loadend
	if defined D30_Table.load (
		call :main "%%~i"
	)
	if "%%~i"=="::%D30_Table.name%" set D30_Table.load=on	
)
:D30_Table.loadend
echo,finish!
pause
exit
::一层c
rem ----------------------------------------------------------一层c
:main
for /f "tokens=*" %%i in ('dir /b %1') do (
	call :D30_delete "%~1\%%~i"
)
goto :eof
:D30_delete
call :a37 1 1 %1 
if "%a37_result%"=="wjj" (
	echo,rd /q/s %1
	rd /q/s %1
) else (
	echo,del %1
	del %1
)
goto :eof
::D30_userData
D:\app\批处理\批处理程序\D16_临时文件夹\小汇总
::D30_userData_end
::函数1
::函数1 end
::函数2
::函数2 end
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
【使用方法	 】:
在::D30_userData和::D30_userData_end之间添加要清空文件夹的全路径
如
D:\folder1
D:\folder2
如果遇到畸形文件夹则使用畸形文件强制删除脚本
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
:a37
@echo off
if "%~2"=="" (
echo,&echo,%%2参数为空!
ping /n 2 127.1>nul
goto exit
)
rem ■将文件拖到批处理时，批处理会运行，但%2参数为空，利用这点来判断批处理是"拖动文件到程序"的调用方式(故其它调用中%2参数必须不为空)
::主代码
rem ----------------------------------------------------------主代码
call :a37_main %3
set a37_str1=
goto :eof
::一层c
rem ----------------------------------------------------------一层c
:a37_main
set a37_str1=%1
set a37_result=
(2>nul pushd %a37_str1%)||(goto a37_文件)
set a37_result=wjj
popd
goto :eof
:a37_文件
set a37_result=wj
goto :eof
rem ----------------------------------------------------------一层c end
::一层c end
::二层c
rem ----------------------------------------------------------二层c
rem ----------------------------------------------------------二层c end
::二层c end
::三层c
rem ----------------------------------------------------------三层c
rem ----------------------------------------------------------三层c end
::三层c end
::四层c
rem ----------------------------------------------------------四层c
rem ----------------------------------------------------------四层c end
::四层c end
::五层c
rem ----------------------------------------------------------五层c
rem ----------------------------------------------------------五层c end
::五层c end
rem ----------------------------------------------------------主代码 end
::主代码 end
::脚本说明
rem ----------------------------------------------------------脚本说明
结果保存在a37_result中，结果为wj或wjj
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:被调用
【文件功能类 】:路径处理
【文件名称   】:判断路径是文件还是文件夹
【参数说明   】:
%1、%2参数无意义
%3为路径变量名
::属性说明 end
::goto
rem ----------------------------------------------------------goto
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------goto end
::goto end
