@echo off
rem ----------------------------------------------------------主代码
set /p D3_str1=输入文字: 
set /p D3_num1=输入重复次数: 
cls
if "%D3_str1%"=="" (
echo,输入错误!
ping /n 2 127.1>nul
goto exit
)
if "%D3_num1%"=="" (
echo,输入错误!
ping /n 2 127.1>nul
goto exit
)
for /l %%i in (1,1,%D3_num1%) do (
echo,%D3_str1%
)
pause>nul
goto exit
::一层call
rem ----------------------------------------------------------一层call
rem ----------------------------------------------------------一层call end
::一层call end
::二层call
rem ----------------------------------------------------------二层call
rem ----------------------------------------------------------二层call end
::二层call end
::三层call
rem ----------------------------------------------------------三层call
rem ----------------------------------------------------------三层call end
::三层call end
::四层call
rem ----------------------------------------------------------四层call
rem ----------------------------------------------------------四层call end
::四层call end
::五层call
rem ----------------------------------------------------------五层call
rem ----------------------------------------------------------五层call end
::五层call end
::脚本说明
rem ----------------------------------------------------------脚本说明
rem ----------------------------------------------------------脚本说明 end
::脚本说明 end
::属性说明
【调用-被调用】:调用
【文件功能类 】:
【文件名称   】:
::属性说明 end
:exit
cls
echo,&echo,即将退出!
ping /n 2 127.1>nul
exit
rem ----------------------------------------------------------主代码 end
::主代码 end
